Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E08A.tmx
Source language: en_us
Languages: zh_cn

source: How to Design a Desert Garden
zh_cn: 自己动手打造荒漠花园

source: Traditional gardens require nutrient rich soil and lots of water, which is not found in desert climates.
zh_cn: 传统的花园需要富含营养物质的土壤和充足的水分，这对于荒漠气候来言简直是天方夜谭。

source: A desert garden uses plants that naturally thrive in hot and dry climates. These plants are better adapted for long droughts and scorching sun.
zh_cn: 来自荒漠的植物在干热的环境生长，能够适应长期的干旱和炎炎烈日。

source: Native plants are also better for the environment than plants from other regions. Plants transported from other regions may become a noxious weed in desert climates and choke out native plants.
zh_cn: 而且土生土长的植物比外来物种更适合在花园中栽培，外来的物种很可能成为本地物种的天敌或竞争者。

source: Gardeners in areas that have cold winters cannot grow desert gardens outside.
zh_cn: 注意：荒漠植物不适合在寒带地区种植。

source: Difficulty: Moderately Easy
zh_cn: 难易程度：中等

source: Things you'll need:
zh_cn: 原料与工具

source: Garden shovel
zh_cn: 园艺铲

source: Sand
zh_cn: 细沙

source: Garden rake
zh_cn: 长柄耙

source: Medium size decorative stones
zh_cn: 中等大小的装饰用卵石

source: Cacti
zh_cn: 仙人掌若干种

source: Leather gloves
zh_cn: 橡胶手套

source: Throw rug
zh_cn: 小块地毯

source: Flowering desert plants
zh_cn: 荒漠开花植物

source: Agave soicta or aloe brevifolia
zh_cn: Soicta龙舌兰、短叶芦荟

source: Pebble sized gravel
zh_cn: 砾石

source: Garden hose
zh_cn: 灌溉用橡胶软管

source: Instructions
zh_cn: 方法

source: Mark off an area for your garden that gets more than six hours of sunlight per day and has excellent drainage and sandy soil.
zh_cn: 选定地点。荒漠花园用地需要每天六小时以上的日照和透水性好的沙质土壤。

source: Turn over the soil in the planting area with a garden shovel.
zh_cn: 使用园艺铲翻松土壤。

source: If your soil does not contain a lot of sand, add a 3-inch layer of sand on top of the soil.
zh_cn: 如果土壤含沙量不够，则需在土壤表面覆盖3英尺的细沙。

source: Work the sand down into the existing soil using a garden rake.
zh_cn: 使用长柄耙将细沙和土壤完全混合。

source: To determine if your soil is sandy or not, take a handful of moistened soil and roll it into a ball.
zh_cn: 判断土壤的含沙量是否合适，可以将土壤微微湿润之后，用手团成一个球。

source: Sandy soil will not form a ball; it will crumble, whereas clay sand will form a tight ball.
zh_cn: 如果含沙量较高，这个球会很快松散开来，而粘土含量较高的土壤会紧密结团。

source: Place medium size stones around the perimeter of the desert garden. Leave a few inches of space between each rock.
zh_cn: 将装饰用卵石铺设在花园周围，注意每颗卵石之间要留一定的距离。

source: Purchase decorative stones at landscape or garden centers.
zh_cn: 这些卵石在盆景店或园艺用品店有售。

source: Look for rocks with unusual shapes or colors to add visual interest to your garden.
zh_cn: 购买时注意挑选颜色丰富，造型奇特的卵石，增加您的花园的观赏性。

source: Plant large cacti at the back of the garden.
zh_cn: 将植株较大的仙人掌种在花园的后部。

source: A barrel cacti is large enough to be the focal point for a desert garden.
zh_cn: 金琥仙人球植株高大，引人注目。

source: Always wear leather gloves when handling cacti.
zh_cn: 种植仙人掌时务必戴好橡胶手套。

source: Place a throw rug around a barrel cactus to avoid getting cuts and scratches as you plant it.
zh_cn: 用小块地毯包裹住植株，以防被刺伤或划伤。

source: Plant flowering desert plants around the large cacti, such as Dorri sage---sometimes called the desert sage---which will bloom with two-toned flowers and reach 18 inches tall.
zh_cn: 将其他荒漠开花植物环绕种植在大仙人掌周围。Dorri 鼠尾草——有时称为沙漠鼠尾草——可生长至18英寸高，开两色花朵。

source: If you like desert wildflowers, the Mexican gold poppy will add a splash of yellow.
zh_cn: 如果您对荒漠开花植物情有独钟的话，还可以种一些墨西哥花菱草，它们可以给花园增添一抹明快的金黄色调。

source: A blooming desert wildflower that looks like it could grow out of a traditional garden is the is the desert lily.
zh_cn: 此外还可以选择和普通百合形态相似的沙漠百合。

source: Any of these plants or a combination will add color to the garden.
zh_cn: 选用一种或几种上述植物搭配种植，能给花园增色不少。

source: Add a few agave soicta plants.
zh_cn: 在花园里点缀一些Soicta龙舌兰。

source: This agave plant will stay relatively small and will make an attractive living border.
zh_cn: 这种植物体型较小，可以当做园地和周围卵石的分界线。

source: Plant each agave soicta about 18 inches apart, 6 inches behind the rocks.
zh_cn: 龙蛇兰之间相距18英尺，与卵石的距离为6英尺。

source: You could also use the small aloe brevifolia for this same purpose. Alternate both of these plants for a border.
zh_cn: 也可以选用短叶芦荟，或两者交替种植，为您的花园戴上一条绿色项链。

source: Lay a 2-inch layer of pebble-sized gravel around the plants.
zh_cn: 在植物周围铺上2英尺厚的砾石。

source: Choose a gravel color to complement your home or the flowers in your desert garden.
zh_cn: 砾石的颜色需和您的房屋以及植物本身的颜色相协调。

source: Water your desert garden with a garden hose right after planting.
zh_cn: 种植完成后使用橡胶软管为植物浇水。

source: Hold the hose close to the ground above the plants' roots. You will not need to water a desert garden every day.
zh_cn: 将软管贴近地面，在植物根部附近浇水。

source: Watering once a week---or less if it rains---is plenty for these types of plants.
zh_cn: 浇水的频率为一周一次，下雨时更要酌情减少。
